# üßº ETL de Vendas - pandas + MySQL

In [ ]:
# ‚úÖ Importa√ß√µes organizadas no topo
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [2]:
# üì• Leitura do CSV bruto
df = pd.read_csv('../raw/vendas_ficticias.csv')
df.head()

,id_venda,data,cliente,produto,quantidade,preco,regiao
0,1,2025-02-14,Jo√£o Pedro,Monitor,2,1940.64,Sul
1,2,2025-01-14,Caroline,Teclado,1,230.29,Sudeste
2,3,2025-04-22,Pietro,Mouse,4,437.88,Centro-Oeste
3,4,2025-05-03,Luiz Miguel,Notebook,3,2968.72,Centro-Oeste
4,5,2025-01-02,Felipe,Teclado,1,3846.88,Nordeste

In [3]:
# üßº Tratamento dos dados
df['data'] = pd.to_datetime(df['data'])
df['receita'] = df['quantidade'] * df['preco']
df.head()

,id_venda,data,cliente,produto,quantidade,preco,regiao,receita
0,1,2025-02-14,Jo√£o Pedro,Monitor,2,1940.64,Sul,3881.28
1,2,2025-01-14,Caroline,Teclado,1,230.29,Sudeste,230.29
2,3,2025-04-22,Pietro,Mouse,4,437.88,Centro-Oeste,1751.52
3,4,2025-05-03,Luiz Miguel,Notebook,3,2968.72,Centro-Oeste,8906.16
4,5,2025-01-02,Felipe,Teclado,1,3846.88,Nordeste,3846.88

In [ ]:
# üõ¢Ô∏è Conex√£o com banco de dados MySQL (ajuste se necess√°rio)
usuario = 'seu_usuario'
senha = 'sua_senha'
host = 'localhost'
porta = '3306'
banco = 'db_vendas'

# Criando engine com SQLAlchemy
engine = create_engine(f'mysql+mysqlconnector://{usuario}:{senha}@{host}:{porta}/{banco}')

# Carga dos dados na tabela 'vendas'
df.to_sql(name='vendas', con=engine, if_exists='replace', index=False)
print("‚úÖ Dados enviados para o banco de dados com sucesso!")

‚úÖ Dados enviados para o banco de dados com sucesso!

In [5]:
# üíæ Exporta√ß√£o do DataFrame tratado para CSV final
df.to_csv('../ready/vendas_tratadas.csv', index=False, encoding='utf-8')
print("‚úÖ Arquivo vendas_tratadas.csv salvo com sucesso na pasta ready!")

‚úÖ Arquivo vendas_tratadas.csv salvo com sucesso na pasta ready!